---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.IPointCloudAccess.GetUnitsToFeetConversionFactor
source: html/f300cafd-1380-8358-1abb-99373506eb02.htm
---
# Autodesk.Revit.DB.PointClouds.IPointCloudAccess.GetUnitsToFeetConversionFactor Method

Implement this method to return the conversion factor from the units of the point cloud to feet.

## Syntax (C#)
```csharp
double GetUnitsToFeetConversionFactor()
```

## Returns
The multiplication factor to convert coordinates of points in this cloud to feet.